system/snappyHexMeshDict
/*--------------------------------*- C++ -*-*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    cylinder.obj
    {
        type        triSurfaceMesh;
        name        cylinder;
    }
    helice.stl
    {
        type        triSurfaceMesh;
        name        helice;
    }
}

castellatedMeshControls
{
    maxLocalCells 100000; // Aumentado para acomodar maior refinamento
    maxGlobalCells 2000000; // Aumentado para acomodar maior refinamento
    minRefinementCells 0;
    maxLoadUnbalance 0.02; // Reduzido para melhorar o equilíbrio de carga e evitar falhas na malha
    nCellsBetweenLevels 6;  // Aumentado para suavizar a transição entre os níveis

    features
    (
        {
            file        "cylinder.eMesh";
            level       1; // Mantido em 1, pois não precisa ser maior
        }
        {
            file        "helice.eMesh";
            level       5; // Refinamento maior, agora ajustado para 5
        }
    );

    refinementSurfaces
    {
        cylinder
        {
            level       (1 1); // Mantido em (1 1) para garantir um refinamento mais controlado
            faceType    boundary;
            cellZone    cylinder;
            faceZone    cylinder;
            cellZoneInside  inside;
        }
        helice
        {
            level       (4 4); // Refinamento alto, agora ajustado para (5 5) para um acabamento melhor
        }
    }

    resolveFeatureAngle 20; // Aumentado para permitir mais flexibilidade na captura das características

    refinementRegions
    {
        cylinder
        {
            mode        inside;
            levels      ((1E15 2)); // Ajustado para manter uma transição mais suave
        }
    }

    locationInMesh (0.01 -0.1 0.01);
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 5;  // Aumentado para melhorar a suavização das superfícies
    tolerance 4.0;
    nSolveIter 30; // Aumentado para 30 para melhorar a convergência
    nRelaxIter 5;  // Aumentado de 3 para melhorar a suavização da malha

    nFeatureSnapIter 10; // Aumentado para 10 para capturar melhor as características da geometria
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
    }
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 70;  // Aumentado para permitir maior flexibilidade nas células não ortogonais
    maxBoundarySkewness 15; // Ajustado para 15 para evitar células muito distorcidas
    maxInternalSkewness 10;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality -1;
    minArea -1;
    minTwist 0.01;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance 1e-5;  // Aumentado para 1e-5 para melhorar a estabilidade numérica
// ************************************************************************* //

