system/heliceInfo
heliceInfo
{
    type            heliceInfo;
    libs            (forces);
    writeControl    writeTime;

    patches         ("helice.*");

    // Setting reference back to wake average Uz velocity computed by [this]
    // function object
    URef            functionObjectValue;
    functionObject  propellerInfo1;
    functionObjectResult UyMean; // Direcao do Vento e Y

    rho             rhoInf; // incompressible
    rhoInf          1.07;

    // Propeller data:
    writePropellerPerformance yes;

    // Radius (218mm = 0.218m)
    radius          0.218;

    rotationMode    specified;

    // rotationMode = specified:
    origin          (-2.427153e-06 0.01306565 5.377094e-06); // Centro de Massa (x, y, z)
    n               3;  // Velocidade de rotação em rotações por segundo
    axis            (0 1 0); // Eixo de rotação

    // Optionally write wake text files
    // Note: controlled by writeControl
    writeWakeFields yes;

    // Sample plane (disk) properties
    // Note: controlled by writeControl
    sampleDisk
    {
        r1              0.05;
        r2              0.2;
        nTheta          36;
        nRadial         10;
        interpolationScheme cellPoint;
        surfaceWriter   vtk;
    }
}

